In [1]:
import numpy as np
import pandas as pd
my_df=pd.read_csv('data.csv')
my_df

      name  colour  number
0    emily    blue     234
1    jason   green     345
2    jacob   white     567
3     jack  purple     678
4     emma  yellow     789
5   justin  orange     547
6     john     red     123
7     rust   black     354
8      rue   brown     232
9    hilda     NaN     653
10    john     red     112
11  carmen  silver     323
12    jake     red     112
13    john     red     234
14    emma    blue     123
15   jason   green     222
16    john     red     235

In [3]:
my_df[(my_df["colour"]=='red') & (my_df["name"]=='john')]

    name colour  number
6   john    red     123
10  john    red     112
13  john    red     234
16  john    red     235

In [4]:
my_df[(my_df["colour"]=='red') | (my_df["name"]=='john')]

    name colour  number
6   john    red     123
10  john    red     112
12  jake    red     112
13  john    red     234
16  john    red     235

In [5]:
len(my_df[(my_df["colour"]=='red') | (my_df["name"]=='john')])

5

In [6]:
my_df[(my_df["colour"]=='red') | (my_df["name"]=='john')]['number']

6     123
10    112
12    112
13    234
16    235
Name: number, dtype: int64